temp = float(input("Введите температуру: "))
pressure = int(input("Введите верхнее давление: "))
pulse = int(input("Введите пульс: "))

if (temp < -50 or temp > 60 or pressure <= 0 or pressure > 300 or pulse <= 0 or pulse > 300):
    print("Ошибка ввода")
elif (temp < 35 or temp > 38 or pressure < 105 or pressure > 140 or pulse < 55 or pulse > 110):
    print("Требуется врач") #   1 и более параметров значительно отклоняются:
                            #- Температура: < 35°C или > 38°C
                            #- Давление: < 105 или > 140
                            #- Пульс: < 55 или > 110
elif (36 <= temp <= 37 and 110 <= pressure <= 130 and 60 <= pulse <= 100):
    print("Нормальное состояние") # Температура 36-37°C, Давление 110-130, Пульс 60-100
else:
    print("Легкое недомогание") # - Температура: 35-36°C или 37-38°C
                                # - Давление: 105-110 или 130-140
                                # - Пульс: 55-60 или 100-110
