x1, y1, x2, y2 = map(int, input("Введите четыре числа от 1 до 8 каждое, задающие номер столбца и номер строки сначала для первой клетки, потом для второй клетки: ").split())

if (x1 < 1 or x1 > 8 or y1 < 1 or y1 > 8 or
        x2 < 1 or x2 > 8 or y2 < 1 or y2 > 8):
    print("Ошибка ввода")
elif x1 == x2 and y1 == y2:
    print("NO")
elif (x1 == x2 or y1 == y2 or
      abs(x1 - x2) == abs(y1 - y2)):
    print("YES")        #Программа выведет «YES», если из первой клетки ходом ферзя можно попасть во вторую
else:
    print("NO")         #выведет «NO» в противном случае.
